docs: proof-reading changes
Signed-off-by: Dhaval Desai <343411+ossdhaval@users.noreply.github.com>
